# Задание-1: уравнение прямой вида y = kx - b задано ввиде строки.
# Определить координату y, точки с заданной координатой x

#equation = 'y = -12x + 11111140.2121'
#x = 2.5
# вычислите и выведите y
equation = 'y = -12x + 11111140.2121'
x = 2.5
eq = equation.split()
ch = float(eq[4])
s = str(eq[2])
d = int(s[:3])
f = d*x
y = f + ch
print("y = {}".format(y))



