# Задача-4: Дан список заполненный произвольными целыми числами
# Получите новый список, элементами которого будут только уникальные элементы исходного

a=[10,24,22,67,43,11,67,12,10,5,3,7,6,22,24]
print(list(set(a)))
